"[{"start":"0:00","end":"0:06","text":"Welcome, so let's start creating some files."},{"start":"0:06","end":"0:10","text":"For that, we can use the system call open()"},{"start":"0:10","end":"0:19","text":"For open() we need to say whether we want to append to an existing file, create a brand file, and we need to give it a file name."},{"start":"0:19","end":"0:26","text":"For example, I might have a file name called \"output.txt\""},{"start":"0:26","end":"0:31","text":"So, the open() call takes 2 or 3 arguments."},{"start":"0:31","end":"0:35","text":"The second argument will be exactly what we want to do."},{"start":"0:35","end":"0:39","text":"In this case, we want to say \"create a brand new file\""},{"start":"0:39","end":"0:43","text":"\"and truncate it back to zero if it doesn't exist\""},{"start":"0:43","end":"0:46","text":"so, I want to truncate as well"},{"start":"0:46","end":"0:54","text":"If we're creating a new file, we better say \"who can read this file and who can write this file and who can execute this file\""},{"start":"0:54","end":"1:01","text":"so, we going to have to say something about the mode flags: who's allowed to do what"},{"start":"1:01","end":"1:06","text":"finally, this call is going to give us back an integer, a file descriptor"},{"start":"1:06","end":"1:08","text":"Just like we've seen so far with FILENO 1 and FILENO 2"},{"start":"1:08","end":"1:14","text":"So let's store that in our little variable."},{"start":"1:14","end":"1:23","text":"So now I better find out what the correct syntax is and what the correct arguments are for creating a file."},{"start":"1:23","end":"1:25","text":"So let's go and look that up."},{"start":"1:25","end":"1:28","text":"That we'll find inside the manual."},{"start":"1:28","end":"1:42","text":"And, if, for example, I type \"man open\" on a command line on a real linux machine (doesn't quite work yet in my small virtual one. we didn't have enough memory to include all the manual pages yet)"},{"start":"1:42","end":"1:47","text":"but, here's a linux manual page I found on the web for the \"open(2)\""},{"start":"1:47","end":"1:51","text":"and you'll see here's the function signature"},{"start":"1:51","end":"1:56","text":"where we're going to pass in an integer for the flags and the mode type"},{"start":"1:56","end":"2:03","text":"so, I'm going to look up now the flags I need to open and create a new file"},{"start":"2:03","end":"2:06","text":"I don't want to do append()"},{"start":"2:06","end":"2:11","text":"I want to use \"create\" and I want to truncate it as well"},{"start":"2:11","end":"2:28","text":"let's include \"O_CREAT\" here. I'm going to say \"O_CREAT\" which is a constant and I'm going to bitwise OR it with the flag to say \"truncate\" so let's look that up as well"},{"start":"2:28","end":"2:43","text":"And, I want to say \"when I open it, I'm going to open it for reading and writing\""},{"start":"2:43","end":"2:49","text":"Now, we need to do the mode"},{"start":"2:49","end":"2:53","text":"Let's write this as a variable."},{"start":"2:53","end":"3:02","text":"It's essentially an integer but it's wrapped in this type here called \"mode_t\""},{"start":"3:02","end":"3:13","text":"We'll say that our file we want to be fairly private and only the owner of the file can access it."},{"start":"3:13","end":"3:19","text":"Let's go back up and find those flags, where are you? Here we go."},{"start":"3:19","end":"3:24","text":"We'll say that the user has read and write permission"},{"start":"3:24","end":"3:38","text":"We'll copy the read one and we'll have write permission as well."},{"start":"3:38","end":"3:45","text":"But no one else in our linux machine will be allowed to read it nor write it."},{"start":"3:45","end":"3:48","text":"So that's the permissions we want"},{"start":"3:48","end":"3:51","text":"What can we do with this?"},{"start":"3:51","end":"3:56","text":"Let's write something out to this file."},{"start":"3:56","end":"4:04","text":"We will write a little message \"Great!\""},{"start":"4:04","end":"4:06","text":"and newline"},{"start":"4:06","end":"4:08","text":"so, how many characters is that?"},{"start":"4:08","end":"4:16","text":"I've got \"one, two, three, four, five, six, and a new line so that's seven characters\""},{"start":"4:16","end":"4:23","text":"then we'll close this file descriptor meaning we don't want to use this file descriptor anymore"},{"start":"4:23","end":"4:30","text":"that will ensure as well that all of the bytes that we send to the file stream have been saved"},{"start":"4:30","end":"4:41","text":"We're not doing any error checking right now, we're just trying to write the smallest possible program to create a file and send somethign to it"},{"start":"4:41","end":"4:44","text":"let's run this and see what we ge"},{"start":"4:44","end":"4:50","text":"we'll run into an error which is: we haven't defined what this mode_t is"},{"start":"4:50","end":"4:56","text":"what we forgot to do, is the includes"},{"start":"4:56","end":"5:03","text":"the good thing is that the man pages tell us which includes we need to put at the top of our program"},{"start":"5:03","end":"5:07","text":"let's grab those and insert them in here"},{"start":"5:07","end":"5:11","text":"just, get the formatting correct"},{"start":"5:11","end":"5:12","text":"and, run it again"},{"start":"5:12","end":"5:23","text":"Our program ran and it's still printing \"Hello\" to standard out and standard error"},{"start":"5:23","end":"5:28","text":"but hopefully, it also secretly created another file"},{"start":"5:28","end":"5:29","text":"let's have a look at that file"},{"start":"5:29","end":"5:37","text":"I can do \"ls\" and see if anything exists starting with \"out\""},{"start":"5:37","end":"5:41","text":"we've got output.txt. great!"},{"start":"5:41","end":"5:44","text":"let's look at the contents of that file"},{"start":"5:44","end":"5:46","text":"and it says \"Great!\" Fantastic"},{"start":"5:46","end":"5:54","text":"Now it's your turn to play: create a file and see if you can send some bytes to that file."},{"start":"5:54","end":"5:55","text":"You'll be using open(), write(), and close(). Bye."}]"