"[{"start":"0:00","end":"0:03","text":"So let's talk more about that file descriptor."},{"start":"0:03","end":"0:09","text":"I'm gonna make my program be a little bit more useful by printing out Hello World a few times."},{"start":"0:09","end":"0:14","text":"For example, I have a variable 'count' here and a little for-loop."},{"start":"0:14","end":"0:21","text":"Start count equals five, while count greater than zero."},{"start":"0:21","end":"0:25","text":"Each time we loop we're going to decrement 'count'"},{"start":"0:25","end":"0:27","text":"In C, there is no boolean type."},{"start":"0:27","end":"0:30","text":"If I got an integer value which is nonzero, that's treated as a 'true' value."},{"start":"0:30","end":"0:39","text":"So, I could actually write this more tersely just by saying \"hey, count!\""},{"start":"0:39","end":"0:40","text":"Because count is a non-zero value."},{"start":"0:40","end":"0:49","text":"And if you compare two things, you'll learn that with each value of either zero or one would mean if they're same or different."},{"start":"0:49","end":"0:54","text":"So, we're going to print out 'Hello World' five times."},{"start":"0:54","end":"1:00","text":"I want to show you just a little idea here that actually I've got two file descriptors."},{"start":"1:00","end":"1:05","text":"I've got two file descriptors which are valid when my program starts."},{"start":"1:05","end":"1:07","text":"And they're called 1 and 2."},{"start":"1:07","end":"1:10","text":"Why might it be useful to have two output streams?"},{"start":"1:10","end":"1:16","text":"We could imagine a program that is calculating something (for example, it's thinking something to say or it's writing to a file)"},{"start":"1:16","end":"1:21","text":"but we also might also want to display some error messages back to the user."},{"start":"1:21","end":"1:27","text":"We might also want to print some progress information."},{"start":"1:27","end":"1:32","text":"So the first output stream, identified by the number 1."},{"start":"1:32","end":"1:34","text":"Is the regular output (the standard output)"},{"start":"1:34","end":"1:37","text":"The second one is reserved for error messages."},{"start":"1:37","end":"1:46","text":"Let's, for example, use this. Instead of error messages, we'll put a little dot to see this"},{"start":"1:46","end":"2:00","text":"We'll run this and we should (if we got everything correct) see \"Hello\" and...lib lib lib lib"},{"start":"2:00","end":"2:14","text":"Now, why do we see \".lib\", because we said \"hey, I'm going to give you a pointer and I want you to use that pointer and take the next 6 bytes from it which is the next  six character"},{"start":"2:14","end":"2:20","text":"So we just got whatever happened to be in memory after our dot. So, we only wanted to do the dot"},{"start":"2:20","end":"2:23","text":"Change that and run it again"},{"start":"2:23","end":"2:30","text":"And great, we've got Hello and dot Hello dot Hello"},{"start":"2:30","end":"2:32","text":"So, right now, both the output and the standard error are going to different places"},{"start":"2:32","end":"2:39","text":"we could actually change that over here in the console before we start the program"},{"start":"2:39","end":"2:44","text":"Our terminal can actually control where the output goes"},{"start":"2:44","end":"2:47","text":"So, for example, I might say, I want to take the standard output and put that into a file."},{"start":"2:47","end":"2:50","text":"So, \"output.txt\""},{"start":"2:50","end":"2:57","text":"So now, if I run this before the program starts, I'm going to redirect it's output into this new file"},{"start":"2:57","end":"3:03","text":"Okay, so what we see on the console output is anything written to standard error"},{"start":"3:03","end":"3:05","text":"The standard output is inside output.txt"},{"start":"3:05","end":"3:10","text":"To prove it, let me have a look at that file."},{"start":"3:10","end":"3:11","text":"Let me cat that file"},{"start":"3:11","end":"3:13","text":"So, output.txt"},{"start":"3:13","end":"3:17","text":"And here it is! It says \"hello, hello, hello, hello\""},{"start":"3:17","end":"3:24","text":"Now, for all those writing 1 and 2 over here, perhaps we should actually have some constants"},{"start":"3:24","end":"3:27","text":"which signify what those values actually mean"},{"start":"3:27","end":"3:38","text":"We could say start define things to say have a constant here, I'll call it say \"STDOUT_FILENO 1\""},{"start":"3:38","end":"3:44","text":"And I'll say define STDERRFILENO 2"},{"start":"3:44","end":"4:02","text":"Anytime you use hash define, you're talking to the preprocessor to say \"hey, in the future, parts of this file, if you come across this character sequence, then replace it (in this case) with either a 1 or a 2 depending on what it is\""},{"start":"4:02","end":"4:14","text":"We can compile this, except I'm going to surprise you which is that these particular macros are already defined within unistd.h"},{"start":"4:14","end":"4:17","text":"So, I don't need to define them here in my program."},{"start":"4:17","end":"4:29","text":"You see it's got a return value of zero. Which is a convention for being correct (no errors)"},{"start":"4:29","end":"4:37","text":"But it's up to us. We could choose a different value, we could choose the value 42."},{"start":"4:37","end":"4:46","text":"And, I don't see an output value, but I can find out what the last exit value was of the last process"},{"start":"4:46","end":"4:48","text":"Let me print out"},{"start":"4:48","end":"4:53","text":"It happens to be inside special variables"},{"start":"4:53","end":"4:55","text":"Hello terminal value of this dollar question mark."},{"start":"4:55","end":"5:00","text":"which means give me the exit value (or the exit status) of the last command run."},{"start":"5:00","end":"5:03","text":"So there's our forty-two."},{"start":"5:03","end":"5:14","text":"Okay so, we've covered quite a bit of ground. We've talked about how in C, any non-zero integer is considered \"true\""},{"start":"5:14","end":"5:16","text":"and zero is considered \"false\""},{"start":"5:16","end":"5:31","text":"And, we've talked about these two different output streams. Now it's your turn to play with this. After that, let's have a go at creating some new files directly from C"},{"start":"5:31","end":"5:33","text":"by making system calls"},{"start":"5:33","end":"5:37","text":"So, now it's your turn. Have fun playing! Bye."}]"