[{"start":"0:00","end":"0:03","text":"let's try this"},{"start":"0:03","end":"0:06","text":"you should be able to write this code yourself"},{"start":"0:06","end":"0:08","text":"and understand how it works"},{"start":"0:08","end":"0:16","text":"we're going to talk about the Reader-Writer problem"},{"start":"0:16","end":"0:22","text":"the Reader-Writer problem crops up in all sort of places"},{"start":"0:22","end":"0:31","text":"maybe in a web server, maybe in a database server and anytime you've got a data structure"},{"start":"0:31","end":"0:38","text":"where you want to read it and update at the same time, you're probably going to run into the Reader-Writer problem"},{"start":"0:38","end":"0:39","text":"so the problem is this"},{"start":"0:39","end":"0:42","text":"I might have multiple threads that want to read from it"},{"start":"0:42","end":"0:45","text":"and multiple threads that want to write to it"},{"start":"0:45","end":"0:53","text":"if I've got a writer that is updating my data structure"},{"start":"0:53","end":"0:57","text":"everybody else needs to wait"},{"start":"0:57","end":"1:03","text":"I can't have two writers trying to change my data structure at the same time"},{"start":"1:03","end":"1:07","text":"it's like two surgeons trying to do the cardiac stuff at the same time. it's not going to work"},{"start":"1:07","end":"1:10","text":"it's going to end badly"},{"start":"1:10","end":"1:14","text":"so we want to make sure that anytime we update data structure"},{"start":"1:14","end":"1:17","text":"everybody else has to wait"},{"start":"1:17","end":"1:22","text":"so if there's multiple writers waiting \"hey get in line, just one at a time please\""},{"start":"1:22","end":"1:25","text":"however, most of the time we don't actually need to update the datastructure"},{"start":"1:25","end":"1:31","text":"most of the time we want to allow our readers to read the data structure"},{"start":"1:31","end":"1:39","text":"we want it to be efficient, in other words more than one reader can read the data structure at a time"},{"start":"1:39","end":"1:42","text":"sounds easy, yes?"},{"start":"1:42","end":"1:52","text":"the reader writer question is a popular question in internship interviews by the way"},{"start":"1:52","end":"2:00","text":"let's have a look at some proposed solutions and see what happens"},{"start":"2:00","end":"2:12","text":"by the way, another thing you can expect in interviews is \"hey, what's the producer consumer problem?\""},{"start":"2:12","end":"2:15","text":"or \"how's it different?\""},{"start":"2:15","end":"2:18","text":"OK, so how is it different?"},{"start":"2:18","end":"2:23","text":"first of all, the reader-writer problem is harder!"},{"start":"2:23","end":"2:28","text":"producer-consumer is easy, we'll actually see it in a couple lectures"},{"start":"2:28","end":"2:36","text":"the producer-consumer is just hey, I want to throw some stuff in this data structure and I want to pull some stuff out of the same data structure"},{"start":"2:36","end":"2:40","text":"and if the data structure is full then you need to wait"},{"start":"2:40","end":"2:45","text":"and if the data structure is empty then you can't pull anything from it and you need to wait"},{"start":"2:45","end":"2:49","text":"and we can implement that with semaphores or conditional variables as well"},{"start":"2:49","end":"2:52","text":"but we'll see that later"},{"start":"2:52","end":"2:58","text":"the reader-writer problem I've got multiple readers running at the same time"},{"start":"2:58","end":"3:06","text":"N readers, that's OK"},{"start":"3:06","end":"3:13","text":"but I only expect one writer at a time"},{"start":"3:13","end":"3:22","text":"anytime I've got a writer everyone else has to stand back, the readers aren't allowed to access the data structure either"},{"start":"3:22","end":"3:27","text":"great, I've defined the problem. let's see if this code works"},{"start":"3:27","end":"3:32","text":"here's some example code, perhaps you and your neighbor can figure out if it's any good"},{"start":"3:32","end":"3:36","text":"or why it's no good"},{"start":"3:36","end":"5:56","text":"<empty>"},{"start":"5:56","end":"6:01","text":"OK, so let's talk about one kind of common gotcha here"},{"start":"6:01","end":"6:05","text":"I've been giving you examples where I've made p_threads, mutex locks and conditional variables just as global variables"},{"start":"6:05","end":"6:11","text":"you don't have to do it that way, you could put them inside heap memory"},{"start":"6:11","end":"6:19","text":"for example if we called malloc, now give me the size of a p_thread mutex pointer"},{"start":"6:19","end":"6:21","text":"is that OK?"},{"start":"6:21","end":"6:29","text":"no! I've just asked for the size of a pointer, that's going to be say 4 bytes on 32-bit system and 8 bytes on a 64-bit system"},{"start":"6:29","end":"6:32","text":"I don't want that. I actually wanted the size of the data structure"},{"start":"6:32","end":"6:36","text":"and unfortunately no one is going to tell you that you got it wrong"},{"start":"6:36","end":"6:40","text":"it's just going to crash at some strange point in the future of the program"},{"start":"6:40","end":"6:43","text":"so watch out for your asterisks "},{"start":"6:43","end":"6:48","text":"a pointer is not the same as the structure"},{"start":"6:48","end":"6:54","text":"good that we've initialized these things, presumably we have to make some more memory for the right lock as well"},{"start":"6:54","end":"7:02","text":"how does this work? well anytime a thread wants to read, it first grabs the read lock and does reading stuff and when it's finished it unlocks"},{"start":"7:02","end":"7:15","text":"how does the write work? it grabs the write lock, and it grabs the read lock! so it can only get through this stuff when it has both of these things"},{"start":"7:15","end":"7:19","text":"so that means that no other writer can be writing at the same time, right?"},{"start":"7:19","end":"7:26","text":"because I've got the lock and if I have the lock you that means you don't have it! You must be stuck inside the write lock"},{"start":"7:26","end":"7:31","text":"so only one of us can actually do the writing"},{"start":"7:31","end":"7:35","text":"this works great, yes?"},{"start":"7:35","end":"7:38","text":"of course it doesn't, it's the first version!"},{"start":"7:38","end":"7:40","text":"how is it broken?"},{"start":"7:40","end":"7:43","text":"<blank>"},{"start":"7:43","end":"7:52","text":"yes, our first problem is that only one person can read at a time. we wanted multiple readers to be able to use our data structure"},{"start":"7:52","end":"7:58","text":"this is insufficient"},{"start":"7:58","end":"8:03","text":"it fails in terms of allowing multiple readers"},{"start":"8:03","end":"8:10","text":"it does a few good things though. it ensures that if a writer is writing then no one else can do anything"},{"start":"8:10","end":"8:11","text":"so that seems pretty good"},{"start":"8:11","end":"8:16","text":"let's have a go at version two"},{"start":"8:16","end":"8:31","text":"in this version we are going to have a couple of integers, which if they are on the stack I'd better set equal to zero"},{"start":"8:31","end":"8:38","text":"and we'll keep track of how many people are really writing"},{"start":"8:38","end":"8:46","text":"should read be locking write? it's not necessary"},{"start":"8:46","end":"8:50","text":"the question is should the read method actualy call write lock as well"},{"start":"8:50","end":"8:56","text":"it's not necessary because the write also grabs the read lock"},{"start":"8:56","end":"9:03","text":"so the writer cannot continue whilst anyone actually has the read lock"},{"start":"9:03","end":"9:09","text":"good question, thanks"},{"start":"9:09","end":"9:13","text":"we'll keep track of this somehow"},{"start":"9:13","end":"9:16","text":"whether reading or writing is actually happening"},{"start":"9:16","end":"9:20","text":"whether someone is actually doing the reading or not"},{"start":"9:20","end":"9:27","text":"what do you think of candidate two?"},{"start":"9:27","end":"9:31","text":"<blank>"},{"start":"9:31","end":"9:32","text":"is this any good?"},{"start":"9:32","end":"9:58","text":"<blank>"},{"start":"9:58","end":"10:00","text":"so you could be doing reading while writing"},{"start":"10:00","end":"10:05","text":"OK, let's have a look at the logic that inspired this and then we'll see why it's broken"},{"start":"10:05","end":"10:12","text":"so the logic behind this is trying to say, while someone is actually doing some writing, I'm not going to touch this. I'm going to wait"},{"start":"10:12","end":"10:20","text":"so then we can carry on and I'm going to raise my little flag to say \"we're doing some reading\""},{"start":"10:20","end":"10:19","text":"and then I'll set reading to false"},{"start":"10:19","end":"10:24","text":"what's the logic that I did behind the writing is to say "},{"start":"10:24","end":"10:28","text":"if anyone is reading or writing, just do a busy loop. we'll burn up some CPU"},{"start":"10:28","end":"10:31","text":"nevermind that, CPUs are cheap"},{"start":"10:31","end":"10:33","text":"and then when we get past here we'll raise my flag"},{"start":"10:33","end":"10:43","text":"I've got writing to do. I'll do my writing stuff. I've raised some flags so anybody else will be stuck inside their busy loops"},{"start":"10:43","end":"10:51","text":"because I've set the flag to true. and the readers will be waiting and any writers will also be waiting inside their while loop"},{"start":"10:51","end":"10:55","text":"the code is fine!"},{"start":"10:55","end":"11:01","text":"it smells a bit? it's not fine!"},{"start":"11:01","end":"11:06","text":"we've got race conditions, just like we saw with the critical section problem"},{"start":"11:06","end":"11:10","text":"with these flags we might be setting the flags a bit late"},{"start":"11:10","end":"11:18","text":"and what would happen if two readers came in?"},{"start":"11:18","end":"11:25","text":"the first reader to finish reading would set the reading flag back down to false"},{"start":"11:25","end":"11:27","text":"it would look like no one is reading"},{"start":"11:27","end":"11:32","text":"you could imagine two writers coming in"},{"start":"11:32","end":"11:39","text":"both writing threads would see that reading and writing are zero or false"},{"start":"11:39","end":"11:43","text":"and so we'll continue. oops! we've got a race condition"},{"start":"11:43","end":"11:49","text":"so we're not doing very well here"},{"start":"11:49","end":"11:56","text":"we're not checking our variables in a careful enough way"},{"start":"11:56","end":"12:01","text":"and we're allowing readers to happen a the same time as writers"},{"start":"12:01","end":"12:10","text":"I could imagine a reader and writer coming in at the same time and they both make it past their while loops because neither of the flags are set yet"},{"start":"12:10","end":"12:09","text":"because they are set later"},{"start":"12:09","end":"12:16","text":"so if the two while loops happen at the same time, whoops! we've allowed both a reader and a write access to the data structure"},{"start":"12:16","end":"12:21","text":"so this is no good, but don't worry, we've got a solution for you!"}]