[{"start":"0:00","end":"0:12","text":"Hello! Let's talk about how we can use scanf and sscanf and fscanf to read some data and convert that into say integers or floats or strings"},{"start":"0:12","end":"0:16","text":"so we can actually use those values inside our variables"},{"start":"0:16","end":"0:19","text":"alright, so, I'll start by using sscanf"},{"start":"0:19","end":"0:22","text":"which can parse data inside a string"},{"start":"0:22","end":"0:23","text":"inside memory"},{"start":"0:23","end":"0:27","text":"so for example, let's have a little bit of data here"},{"start":"0:27","end":"0:32","text":"I'll have my data be my name and a score"},{"start":"0:32","end":"0:39","text":"and I want to take that pull it apart into a string and an integer"},{"start":"0:39","end":"0:43","text":"so I'll have a little buffer here, say, up to twenty characters"},{"start":"0:43","end":"0:46","text":"and a little integer here"},{"start":"0:46","end":"0:53","text":"and I could set this to be equal to some arbitrary value. we'll see why in a little bit"},{"start":"0:53","end":"1:11","text":"and I'm going to say \"okay, sscanf please read from this string array and what I'd like you to do is convert that into a string followed by one or more spaces and then an integer value\""},{"start":"1:11","end":"1:15","text":"alright so scanf is going to look at our memory starting at wherever our data is pointing at"},{"start":"1:15","end":"1:22","text":"and, it's going to first of all look for a string until it comes across one space"},{"start":"1:22","end":"1:25","text":"and then it can be actually multiple spaces in our data"},{"start":"1:25","end":"1:29","text":"and then after that, it's going to treat the rest of the string as an integer"},{"start":"1:29","end":"1:42","text":"okay, now, our format specifiers say the kind of data that we want to interpret and also the number of bytes that should be written to when it is trying to parse its data"},{"start":"1:42","end":"1:45","text":"so we better tell it where to exactly put this data"},{"start":"1:45","end":"1:45","text":"for a string, we want it to write it into a buffer"},{"start":"1:45","end":"1:50","text":"and for the score, we want to write it into our score variable"},{"start":"1:50","end":"1:51","text":"but hold on a moment"},{"start":"1:51","end":"1:57","text":"when we say \"buffer\" yes that gives us the beginning address of our array"},{"start":"1:57","end":"1:59","text":"but not for score"},{"start":"1:59","end":"2:00","text":"score is just going to give us whatever value score happens to hold"},{"start":"2:00","end":"2:04","text":"in this case, negative forty two"},{"start":"2:04","end":"2:03","text":"that's not what we need"},{"start":"2:03","end":"2:06","text":"we actually want the address of this variable"},{"start":"2:06","end":"2:09","text":"so we're going to say ampersand score"},{"start":"2:09","end":"2:14","text":"so, lets read that and we'll print it out"},{"start":"2:14","end":"2:23","text":"so here's the result and we'll say %s %d and we'll print the contents of the buffer and print the value of score"},{"start":"2:23","end":"2:29","text":"so notice that scanf and printf, the arguments don't always look the same"},{"start":"2:29","end":"2:33","text":"when we want to print out the values, we don't actually want to just print out the address of score"},{"start":"2:33","end":"2:36","text":"we actually wanted to know what the value is"},{"start":"2:36","end":"2:38","text":"so that read that correctly"},{"start":"2:38","end":"2:45","text":"scanf actually tells us something else which is how many arguments it correctly managed to parse"},{"start":"2:45","end":"2:49","text":"so let's make a note of that and we'll print that out"},{"start":"2:49","end":"2:52","text":"so, we'll say %d here"},{"start":"2:52","end":"2:58","text":"print out the result in our printf statement here"},{"start":"2:58","end":"3:04","text":"so now when we run it, we'll see that sscanf managed to read both iterms"},{"start":"3:04","end":"3:06","text":"I got result two"},{"start":"3:06","end":"3:12","text":"fantastic. so that's useful. now we can write robust programs to check if we really did write into both variables"},{"start":"3:12","end":"3:18","text":"now you might be worried that scanf could result in a buffer overflow"},{"start":"3:18","end":"3:21","text":"and, in fact, in our current code, you'd be right"},{"start":"3:21","end":"3:26","text":"so if I had a very long name with no spaces here"},{"start":"3:26","end":"3:31","text":"then that's longer than our buffer"},{"start":"3:31","end":"3:35","text":"so what we need to do is tell scanf just how big our buffer is"},{"start":"3:35","end":"3:38","text":"so in this case, it should be nineteen"},{"start":"3:38","end":"3:42","text":"because we're setting scanf how many character to read from the input"},{"start":"3:42","end":"3:50","text":"and our buf, of course, if going to need one extra one to hold the terminating byte for this string"},{"start":"3:50","end":"3:51","text":"so let's run this now"},{"start":"3:51","end":"4:04","text":"and you'll see that first of all the name is truncated and that secondly, the return value of our scanf call here was one"},{"start":"4:04","end":"4:10","text":"and it only managed to read into the buffer"},{"start":"4:10","end":"4:11","text":"it gave up trying to read the integer because our buffer wasn't long enough"},{"start":"4:11","end":"4:17","text":"and, in fact, our score variable still contained its original value"},{"start":"4:17","end":"4:19","text":"negative forty two"},{"start":"4:19","end":"4:24","text":"so good defensive programs must check that the return value is reasonable"},{"start":"4:24","end":"4:37","text":"also, when writing scanf or sscanf or fscanf, it's always a good idea to carefully check to see whether you should be looking at the address of the variable or if the variable itself actually is a pointer"},{"start":"4:37","end":"4:44","text":"and is already going to give you the memory address that you'd like scanf to change"},{"start":"4:44","end":"4:48","text":"alright so we've read data from a string "},{"start":"4:48","end":"5:00","text":"we can also parse data from a file stream and how can we do that? you can use not sscanf but fscanf"},{"start":"5:00","end":"5:03","text":"and if you did that, you better give it a file stream"},{"start":"5:03","end":"5:06","text":"there's one called stdin already"},{"start":"5:06","end":"5:14","text":"if we didn't want to use that, then we could open up a file using fopen and then pass in the file handle here"},{"start":"5:14","end":"5:25","text":"and reading from stdin is such a common occurance that in fact there's another form of this which is just say scanf"},{"start":"5:25","end":"5:29","text":"and if you do that, that means \"hey, just read from stdin\""},{"start":"5:29","end":"5:33","text":"now, let's run our program here"},{"start":"5:33","end":"5:39","text":"and, now it's waiting for input"},{"start":"5:39","end":"5:40","text":"so let me typing something"},{"start":"5:40","end":"5:44","text":"I'll say \"Angrave one hundred\""},{"start":"5:44","end":"5:50","text":"great! and it managed to parse both variables"},{"start":"5:50","end":"5:53","text":"so that's enough introduction to scanf"},{"start":"5:53","end":"6:02","text":"remember this next time you're trying to read 3d data and points and you want to say convert those ASCII into actual floats and doubles"},{"start":"6:02","end":"6:14","text":"and also remember that its important to read exactly how scanf uses these format specifiers because its not quite the same as printf"},{"start":"6:14","end":"6:14","text":"alright, that's it for me. time for you to play. bye!"},{"start":"6:14","end":"6:15","text":"for now"}]